import type { Post } from "../types";

const post: Post = {
  slug: "2020-year-in-review",
  title: "2020，写给自己 | 掘金年度征文",
  date: "2020年12月28日",
  excerpt: "也许日记都是想到什么写什么，不论开心或是难受，落笔便成了回忆。回望2020这不平凡的一年。",
  content: `
# 前述：

此刻，我在听邓紫棋的《偶尔》~~~

# 正文：

也许是日记都是想到什么写什么，不论是开心或是难受。落笔便成了回忆。反而到了真的去总结这一年的时候，便会有一种 心里有一万句话，但是该先说哪一句？顿挫、突兀。

## 关于疫情：

今年始于疫情，还未结束，我的这一年，也是从疫情开始~

一月份的尾巴，临近过年，妹妹打电话来：说从深圳先回上海，然后再一起回去过年。很是开心，于是来上海的那晚，我去机场接了她。那晚深夜，我被流感了。当时正是吹哨人-李文亮烈士吹哨的时候。也是开始意识到新冠真的存在的时期。当然我没有很恐慌，只是当普通流感一样。后来，领导让我先不用去上班了，去医院检查休息。我去医院检查，医生说目前检测出来 只是流感，还不确定是新冠。后面休息了一天，就启程回老家了。

![](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/443694a6a3d44df99cda8260363f378f~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp)

回老家的路上...

记得那天 是晚上六七点的样子从上海出发了，带着我家猫。小家伙在车上 上窜下跳，很是好奇。前半段还是有说有笑的状态（当时我还在感冒中...）。

路上还没开多久就开始堵车，家人们在车上聊着这次的疫情，会怎样怎样，但是谁也不知道的是，接下来的几个小时，接收到的消息，会让整个气氛紧张到极点。

晚上九点多，还在高速上堵着，微博爆出新冠确证20多例，几分钟后，微博继续爆出60多例，然后就是300，500，600，1000...数字在疯狂的上涨，一路上，一直在倒吸凉气。（先开始还在想这次疫情会到哪种地步的时候，突然的消息，已经不允许当下去猜测，而是做好接受这个现时的准备吧。）

当看到1000+的消息之后，思绪停顿了一会，先是震惊，再是害怕，再到清醒 做好防护。给在家中的爸妈打了一通电话，催促赶紧去囤口罩，消毒液...(当时家里还不觉得严重...)

经历了一夜，终于到家了。感觉到了最安全的地方，整个人也轻松了些~

![](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/7404c0b6babc424982ab279513911b9f~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp)

今年没有年味儿...

到家之后，就在家好好休息，毕竟还在感冒。然后计划着准备大年初二的时候去亲戚家拜年，被告知武汉封城，不允许串门，今年改为电话视频拜年。于是，就这样在家呆了一个年，记忆也只停留在疫情的阴影中，没有往年的喜悦和开心。

后来，说要封村，封路。于是大年初七，就早早的返沪了，来了上海，继续在家隔离，在家办公。一周出门一次，购置生活用品和一周的口粮。可谓是全副武装。（心里想着赶紧结束这样的一个阴暗期吧...）
![](https://p1-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/c7fb5ef928db47ce81dff9e6ab33b630~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp)

## 关于工作：

3月16号上午9：21分，领导给我了发微信（疫情在家办公）。年终的升职加薪已经执行了，职级升了两级。加薪，因为疫情，暂缓。因为年底领导给我聊过，承诺了会给到我应该拿到的待遇。(这边插一个题外话吧，关于升职加薪，希望看到这篇文章的朋友，一定要主动找领导提出你的需求。工作中，很排斥职不对薪。尤其在互联网行业，只要你觉得你能力在这，就主动去争取你应得的，因为领导很忙，他不会了解下面的全部员工，所以好的千里马一定要主动去找你的伯乐。讲清楚你的诉求。)

知道这个消息，先是喜悦，连升两级，可以说是很荣幸，并且是很不容易的事情。这里要感谢前领导的认可跟肯定。接着迎面来的就是低落。因为加薪暂缓了，这个可能会让我觉得被开了空头支票一样，我很丧。领导察觉到了我的情绪，承诺等疫情结束，会半年给我一次调薪，最快涨幅来弥补我。(当时我很感动，说实在的，因为前领导表明了需要我的意思。但好像无意中又给了我一堆空头支票...)

后来关于这个问题，我纠结了很久，到底是走是留，当时会觉得，公司在危难时刻，我应该尽自己的能力，做力所能及的事情，并且部门需要我，领导认可我。可是另一面。我做着五级员工都做不来的事，拿着三级员工的薪资。很不是滋味。当然这个要看个人，我是不能说服自己。之后就再反思，我的个人价值，以及我的人生规划。后来我还是决定离开xc(就不直接说公司名拉~)。

之后，我就给自己放了半个月的假，出去玩了一圈，当时四月份，国内疫情初步得到了稳定和控制。那半个月，我想清楚了一些事。

![](https://p1-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/052c1d2137e94be091a1d3ad1adb2b94~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp)

## 关于公司：

从我进入互联网的那一刻，我就一直在给自己解惑，互联网公司到底是一个什么样的公司，我的刻板印象只是技术公司，技术至上。可是在xc的那一年十个月，好像一直在告诉我一些，可能会让我想不明白的事。公司是靠业务活着的。其实我是一直知道一个原则性的理论就是：一个好的产品不单单要做的好，还要卖的出去。做的好的前提当然是要技术，卖出去的前提是要了解市场，悉知需求。这里我也是读过郎咸平和吴晓波书的（憨笑一声）。有些经济理论不够深厚，但是也算浅尝。

所以互联网公司，真的业务是最高的权益者吗？做技术的是不是就要给业务让步呢？当时在一个觉得技术是最高权益者的认知里面，是无法接受，并且不认可和不赞同的。（目前依然是）。而xc恰恰是以业务为中心的。可能这，从一开始就种下了，离开的种子。

所以，我需要的是一个：以技术为重心的互联网科技公司。这是技术人最后的倔强跟坚持！

## 关于自己

终于到了，最想聊的一段，也憋了很久。（但是可能也不能完全表达出来，好像自己是一个不怎么会表达的人了...）

作为一个18年毕业的本科生，并且大学还不是学IT专业的"初生牛犊"来讲，能进入互联网公司，真的是阴差阳错的事情。其实这里我很想感谢，我的直属领导，直到现在，跟他聊起天儿来，他还会说，当初没看错我。算是一种长期认可了（再次憨笑一声）。刚进公司，从一个小白什么都不会，简单的命令行开始一步步学起。到现在能够独立的写一个全栈的项目（还是菜鸟）。可想期间经历的种种，总结一个字：痛。并且这份痛会一直坚持下去。

18年十月份接触了前端，个人展示出了极高的兴趣和天赋（自嘲），加上前端的小伙伴的热情"手摸手"传授。于是努力了无数个夜晚。最终没辜负他们。学有小成。在此期间，知道并认识了表哥：表严肃（[表严肃](https://link.juejin.cn/?target=https%3A%2F%2Fbiaoyansu.com%2F) ）。可以说，在那段最痛苦的时候，表哥无疑是我的精神食粮。(应该很多人，都会在成长的道路上，拥有自己的精神食粮，可能它是一首暖到自己的歌，可能它是一只懂你的宠物，甚至可能他/她是一个你精神世界的引领者。以上是我的观点，不能够表示全部敖。)现在想到表哥，还有点忍不住会眼眶含泪。只是太久没有他的消息，有点不知道他最近怎样。想念。

20年三月底，我离开xc之后，来到了新的公司，在这边，我不再拥有我之前的朋友(我更愿意称他们是朋友，而不是同事。)自己在新的环境中，适应，并成长。在这里，我成长了很多。靠自己也做出了大大小小的项目。这里也让我跳出了之前在xc的"井底"思维，可能这样说有点忘本，或者不好，但是还是想这样去写，因为，离开了那里，我看到了更大的世界。回过头来，我还是很想去感谢它。因为它也成就了今天的我。

## 关于学习

其实每个人都有自己的学习方法，获取知识，也有自己的方式。我有些不敢把自己的学习方法分享出来，不是吝啬，只是觉得自己还不够资格。还需要更多的历练和成长。当然我也没有那么优秀。说实在的，我现在有点觉得我的能力配不上我的目标。所以更要沉下心来，去朝着心里向往的方向前进，做心里觉得对，并要坚持做下去的事。希望你们也一样，为了自己更好的以后，为了自己心里想要的样子，加油。

# 结尾

此刻，我在听黄义达的《蓝天》~~~

虽是写给自己，也是写给你们。再见~

[掘金年度征文 | 2020 与我的技术之路 征文活动正在进行中......](https://juejin.cn/post/6901125532729999374)
`,
};

export default post;
